using Photon.Pun.Demo.SlotRacer.Utils;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UIElements;

public class GridManager : MonoBehaviour
{
    public GameObject wallPrefab;               // 고정된 벽
    public List<GameObject> obstaclePrefabs;    // 파괴 가능한 장애물
    public GameObject spawnPointPrefab;         // 플레이어 스폰 지점
    public GameObject movingBoxPrefab;          // 움직이는 오브젝트
    public GameObject enterablePrefab;          // 통과되는 오브젝트
    public GameObject groundPlane;              // 바닥 Plane
    public Vector3 offset;                      // 맵 전체 위치 조정

    private int[,] mapData = {
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 2, 2, 2, 2, 0, 3, 0, 2, 0, 3, 0, 2, 2, 2, 2, 1 },
        { 1, 2, 1, 2, 0, 4, 4, 4, 0, 4, 4, 4, 0, 2, 1, 2, 1 },
        { 1, 2, 2, 0, 4, 0, 2, 0, 4, 0, 2, 0, 4, 0, 2, 2, 1 },
        { 1, 2, 0, 4, 0, 2, 2, 2, 2, 2, 2, 2, 0, 4, 0, 2, 1 },
        { 1, 2, 0, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 0, 2, 1 },
        { 1, 2, 3, 4, 0, 2, 2, 2, 2, 2, 2, 2, 0, 4, 3, 2, 1 },
        { 1, 2, 0, 4, 2, 2, 2, 1, 1, 1, 2, 2, 2, 4, 0, 2, 1 },
        { 1, 2, 2, 0, 4, 3, 2, 2, 2, 2, 2, 3, 4, 0, 2, 2, 1 },
        { 1, 2, 2, 2, 0, 4, 0, 2, 2, 2, 0, 4, 0, 2, 2, 2, 1 },
        { 1, 2, 2, 2, 2, 0, 4, 0, 2, 0, 4, 0, 2, 2, 2, 2, 1 },
        { 1, 2, 2, 0, 2, 2, 0, 4, 4, 4, 0, 2, 2, 0, 2, 2, 1 },
        { 1, 2, 1, 0, 2, 2, 2, 0, 0, 0, 2, 2, 2, 0, 1, 2, 1 },
        { 1, 2, 0, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 0, 2, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }

    };

    private GameObject mapContainer; // 맵의 모든 오브젝트를 담는 컨테이너
    private SpawnPointManager spawnPointManager;

    /// <summary>
    /// 맵 데이터에 의하여 생성하도록 하는 메서드.
    /// </summary>
    public void GenerateMap()
    {
        ClearMap();
        CreateGroundPlane(); // 바닥 Plane 생성

        // 맵 컨테이너 생성
        mapContainer = new GameObject("MapContainer");
        mapContainer.transform.parent = transform;

        for (int z = 0; z < mapData.GetLength(0); z++)
        {
            // Z축 기준으로 맵 컨테이너에 생성
            GameObject zParent = new GameObject($"Z_{z}");
            zParent.transform.parent = mapContainer.transform;

            for (int x = 0; x < mapData.GetLength(1); x++)
            {
                Vector3 position = new Vector3(x + offset.x, 1f + offset.y, -z + offset.z);
                Quaternion rotation = Quaternion.Euler(0, 180f, 0);
                Vector3 WallPos = new Vector3(x + offset.x, 1f + offset.y, -z + offset.z);
                Vector3 spawnPos = new Vector3(x + offset.x, -0.5f + offset.y, -z + offset.z);
                GameObject tileObject = null;

                switch (mapData[z, x])
                {
                    case 1: // 벽
                        tileObject = Instantiate(wallPrefab, WallPos, Quaternion.identity, zParent.transform);
                        tileObject.tag = "Obstacle";
                        break;
                    case 2: // 파괴 가능한 장애물
                        if (obstaclePrefabs != null && obstaclePrefabs.Count > 0)
                        {
                            GameObject randomObstacle = obstaclePrefabs[Random.Range(0, obstaclePrefabs.Count)];
                            tileObject = Instantiate(randomObstacle, position, rotation, zParent.transform);
                            tileObject.tag = "Box";
                        }
                        break;
                    case 3: // 스폰 지점
                        tileObject = Instantiate(spawnPointPrefab, spawnPos, Quaternion.identity, zParent.transform);
                        tileObject.tag = "SpawnPoint";
                        break;

                    case 4: // 파괴 가능한 장애물
                        if (movingBoxPrefab != null)
                        {
                            tileObject = Instantiate(movingBoxPrefab, new Vector3(position.x, 0, position.z), rotation, zParent.transform);
                            tileObject.tag = "Box";
                        }
                        break;
                    case 5: // 통과 가능한 장애물
                        if (enterablePrefab != null)
                        {
                            tileObject = Instantiate(enterablePrefab, new Vector3(position.x, 0, position.z), rotation, zParent.transform);
                        }
                        break;
                }

                if (tileObject != null)
                {
                    tileObject.name = $"Tile_x({x})_z({z})";
                }
            }
        }

        // 스폰 포인트 관리 스크립트 호출
        if (spawnPointManager == null)
        {
            spawnPointManager = mapContainer.gameObject.AddComponent<SpawnPointManager>();
        }

        //spawnPointManager.LoadSpawnPoints();
    }

    /// <summary>
    /// 맵 생성시 바닥을 Plane으로 크기를 조정해서 생성하는 메서드.
    /// </summary>
    public void CreateGroundPlane()
    {
        Vector3 planePosition = new Vector3
            (
                (mapData.GetLength(1) - 1) / 2f + offset.x,
                0.5f + offset.y, 
                -(mapData.GetLength(0) - 1) / 2f + offset.z
            );

        GameObject ground = Instantiate(groundPlane, planePosition, Quaternion.identity, transform);
        ground.name = "GroundPlane";

        ground.transform.localScale = new Vector3(mapData.GetLength(1) / 10f, 1, mapData.GetLength(0) / 10f);
    }

    /// <summary>
    /// 만들어진 맵을 삭제할수 있도록 한 메서드.
    /// </summary>
    public void ClearMap()
    {
        for (int i = transform.childCount - 1; i >= 0; i--)
        {
            // Destroy는 다음 프레임에서 제거.(Play 모드에서만 동작)
            // DestroyImmediate는 객체를 즉시 제거할 때 사용.(Play 모드와 에디터 모드 둘 다 동작)
            DestroyImmediate(transform.GetChild(i).gameObject);
        }
    }
}


#region Test Map Data
/*
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 3, 0, 0, 2, 2, 2, 2, 0, 0, 3, 0, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 0, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1 },
        { 1, 0, 2, 0, 2, 0, 0, 0, 2, 0, 2, 0, 1 },
        { 1, 2, 1, 2, 1, 0, 0, 0, 1, 2, 1, 2, 1 },
        { 1, 2, 2, 2, 2, 0, 0, 0, 2, 2, 2, 2, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1 },
        { 1, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 3, 0, 0, 2, 2, 2, 2, 0, 0, 3, 0, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
 */
#endregion

#region Map01
/*
    { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 2, 0, 2, 0, 2, 1, 2, 0, 2, 0, 2, 1 },
        { 1, 0, 2, 1, 2, 1, 1, 1, 2, 1, 2, 0, 1 },
        { 1, 2, 0, 2, 0, 2, 1, 2, 0, 2, 0, 2, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
        { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
        { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }

 */
#endregion

#region Map02
/*
  { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 0, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
    { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
 */
#endregion

#region Map03
/*
  { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 0, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 0, 0, 0, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 0, 0, 0, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 0, 1, 2, 1, 2, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 3, 1 },
    { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
 */
#endregion

#region Map18x18
/*
 { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 0, 3, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 1, 0, 0, 0, 0, 0, 1, 2, 1, 2, 1, 2, 1 },
    { 1, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 0, 2, 2, 1, 2, 2, 0, 2, 1, 2, 1, 2, 1 },
    { 1, 2, 0, 2, 0, 0, 0, 2, 2, 2, 0, 0, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 0, 0, 0, 1, 2, 1, 2, 1, 2, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1 },
    { 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 1 },
    { 1, 0, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0, 1 },
    { 1, 3, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 0, 3, 1 },
    { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
*/
#endregion

#region Patrit14(15x13)
/*
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 2, 2, 2, 2, 0, 3, 0, 2, 0, 3, 0, 2, 2, 2, 2, 1 },
        { 1, 2, 1, 2, 0, 4, 4, 4, 0, 4, 4, 4, 0, 2, 1, 2, 1 },
        { 1, 2, 2, 0, 4, 0, 2, 0, 4, 0, 2, 0, 4, 0, 2, 2, 1 },
        { 1, 2, 0, 4, 0, 2, 2, 2, 2, 2, 2, 2, 0, 4, 0, 2, 1 },
        { 1, 2, 0, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 0, 2, 1 },
        { 1, 2, 3, 4, 0, 2, 2, 2, 2, 2, 2, 2, 0, 4, 3, 2, 1 },
        { 1, 2, 0, 4, 2, 2, 2, 1, 1, 1, 2, 2, 2, 4, 0, 2, 1 },
        { 1, 2, 2, 0, 4, 3, 2, 2, 2, 2, 2, 3, 4, 0, 2, 2, 1 },
        { 1, 2, 2, 2, 0, 4, 0, 2, 2, 2, 0, 4, 0, 2, 2, 2, 1 },
        { 1, 2, 2, 2, 2, 0, 4, 0, 2, 0, 4, 0, 2, 2, 2, 2, 1 },
        { 1, 2, 2, 0, 2, 2, 0, 4, 4, 4, 0, 2, 2, 0, 2, 2, 1 },
        { 1, 2, 1, 0, 2, 2, 2, 0, 0, 0, 2, 2, 2, 0, 1, 2, 1 },
        { 1, 2, 0, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 0, 2, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
 */
#endregion

#region Factroy07(15x13)
/*
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 0, 0, 0, 1, 2, 2, 2, 1, 2, 2, 2, 1, 0, 0, 0, 1 },
        { 1, 0, 1, 3, 1, 4, 1, 4, 1, 4, 1, 4, 1, 3, 1, 0, 1 },
        { 1, 2, 2, 2, 2, 2, 2, 0, 3, 0, 2, 2, 2, 2, 2, 2, 1 },
        { 1, 1, 4, 1, 4, 1, 4, 1, 0, 1, 4, 1, 4, 1, 4, 1, 1 },
        { 1, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 1 },
        { 1, 0, 1, 4, 1, 4, 1, 2, 4, 2, 1, 4, 1, 4, 1, 0, 1 },
        { 1, 3, 0, 2, 2, 2, 4, 2, 1, 2, 4, 2, 2, 2, 0, 3, 1 },
        { 1, 1, 2, 1, 2, 2, 1, 2, 4, 2, 1, 2, 2, 1, 2, 1, 1 },
        { 1, 2, 2, 2, 2, 1, 4, 0, 1, 0, 4, 1, 2, 2, 2, 2, 1 },
        { 1, 1, 2, 1, 2, 2, 1, 0, 3, 0, 1, 2, 2, 1, 2, 1, 1 },
        { 1, 2, 2, 2, 2, 1, 4, 2, 1, 2, 4, 1, 2, 2, 2, 2, 1 },
        { 1, 1, 0, 1, 2, 2, 1, 2, 2, 2, 1, 2, 2, 1, 0, 2, 1 },
        { 1, 0, 3, 0, 2, 1, 2, 2, 1, 2, 2, 1, 2, 0, 3, 0, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
 */
#endregion

#region Frorest08(15x13)
/*
 { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 0, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 2, 2, 2, 1, 1 },
        { 1, 3, 0, 2, 2, 2, 0, 3, 2, 2, 2, 2, 1, 1, 2, 2, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 0, 1, 2, 1, 0, 2, 2, 2, 1, 1 },
        { 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 3, 1, 1, 2, 2, 1 },
        { 1, 0, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 2, 2, 2, 1, 1 },
        { 1, 3, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 2, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0, 2, 2, 1, 1, 1 },
        { 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 3, 2, 1, 2, 1, 1 },
        { 1, 0, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2, 1, 1 },
        { 1, 3, 0, 2, 2, 2, 1, 2, 2, 2, 2, 2, 0, 1, 2, 1, 1 },
        { 1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 0, 1, 2, 1, 2, 1, 1 },
        { 1, 3, 0, 2, 2, 1, 2, 2, 2, 0, 3, 2, 2, 1, 1, 1, 1 },
        { 1, 0, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 1, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
*/
#endregion

#region Village10(15x13)
/*
 { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },
        { 1, 0, 2, 2, 2, 2, 2, 0, 3, 2, 2, 1, 2, 1, 0, 1, 1 },
        { 1, 0, 1, 2, 1, 2, 1, 2, 0, 0, 1, 2, 2, 0, 3, 0, 1 },
        { 1, 0, 3, 2, 2, 2, 2, 0, 2, 2, 2, 1, 2, 1, 2, 1, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 2, 0, 0, 1, 2, 1, 1, 2, 2, 1 },
        { 1, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 1, 2, 1, 2, 1, 1 },
        { 1, 2, 1, 2, 1, 2, 1, 2, 2, 0, 0, 2, 2, 2, 2, 2, 1 },
        { 1, 1, 2, 1, 2, 1, 2, 0, 0, 2, 2, 1, 2, 1, 2, 1, 1 },
        { 1, 2, 2, 2, 2, 2, 0, 2, 0, 0, 1, 2, 1, 2, 1, 2, 1 },
        { 1, 1, 2, 1, 2, 1, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 1 },
        { 1, 2, 2, 2, 2, 2, 1, 2, 0, 0, 1, 2, 1, 2, 1, 2, 1 },
        { 1, 1, 0, 1, 2, 1, 2, 0, 3, 2, 2, 2, 2, 2, 2, 0, 1 },
        { 1, 0, 3, 1, 2, 1, 1, 2, 2, 0, 1, 2, 1, 2, 1, 0, 1 },
        { 1, 1, 0, 1, 2, 1, 2, 0, 0, 2, 2, 2, 2, 2, 0, 3, 1 },
        { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }
*/
#endregion